<a href="https://colab.research.google.com/github/rohankoditala/skills-introduction-to-github/blob/main/Project_1_Identifying_customer_geographies_The_Well_Grounded_Data_Analyst.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
import pandas as pd# import pandas data library
customers = pd.read_csv("addresses.csv")# we imported our addresses csv file into the customer variable
print(customers.shape)# we used the customers.shape in order to get the rows,colums output
customers.isnull().sum() #we use this function to determine how many missing values

(100000, 3)

company_id       0
address        968
total_spend      0
dtype: int64

In [17]:
customers = customers.dropna(subset=["address"])# we used this function to drop the records with no values
customers.isnull().sum()# we used this function to check if we have no missing values

company_id     0
address        0
total_spend    0
dtype: int64

In [16]:
customers["total_spend"].describe()

count    99032.000000
mean      4951.673197
std       1500.642398
min          0.000000
25%       3900.000000
50%       5000.000000
75%       6000.000000
max      11700.000000
Name: total_spend, dtype: float64